
#Область СлужебныеПроцедурыИФункции

Функция ПараметрыПодключения() Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить("Адрес", Константы.АдресRabbitMQ.Получить());
	Настройки.Вставить("Порт", Константы.ПортRabbitMQ.Получить());
	Настройки.Вставить("ВиртуальныйХост", Константы.ВиртуальныйХостRabbitMQ.Получить());
	Настройки.Вставить("Логин", Константы.ЛогинRabbitMQ.Получить());
	Настройки.Вставить("Пароль", Константы.ПарольRabbitMQ.Получить());
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти
