
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция - Название вакансии по шаблону
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - Организация.
//  Должность	 - СправочникСсылка.Должности - Должность.
// 
// Возвращаемое значение:
//  НазваниеВакансии - Строка
//
Функция НазваниеВакансииПоШаблону(Организация, Должность) Экспорт
	
	НазваниеВакансии = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 (%2)'"), Должность, Организация);
	
	Возврат НазваниеВакансии;
	
КонецФункции

#КонецЕсли