
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	ДолжностьПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.ВалютаЗарплаты) Тогда
		Объект.ВалютаЗарплаты = Константы.ВалютаЗарплатыВВакансияхПоУмолчанию.Получить();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЗаполнитьНазваниеВакансииПоШаблону();
	
КонецПроцедуры

&НаСервере
Процедура ДолжностьПриИзмененииНаСервере()
	
	ЗаполнитьНазваниеВакансииПоШаблону();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНазваниеВакансииПоШаблону()
	
	Если Не ЗначениеЗаполнено(Объект.Наименование)
		И ЗначениеЗаполнено(Объект.Владелец) И ЗначениеЗаполнено(Объект.Должность) Тогда
		Объект.Наименование = Справочники.Вакансии.НазваниеВакансииПоШаблону(Объект.Владелец, Объект.Должность);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
